
//***************************************************************************
// Job.h : interface for the CJob class.
//
//***************************************************************************

#ifndef __JOB_H__
#define __JOB_H__

#pragma once

#include <functional>

using CallbackType = std::function<void()>;

//***************************************************************************
// @brief 비동기 작업을 캡슐화하여 실행하는 클래스입니다.
// @detail 콜백 함수를 받아 저장하고, 필요할 때 해당 작업을 실행할 수 있는 기능을 제공합니다.
//***************************************************************************
class CJob
{
public:
	//***************************************************************************
	// @brief CJob 클래스의 생성자입니다.
	// @detail 전달받은 콜백 함수로 작업을 초기화합니다.
	// @param callback 실행할 콜백 함수
	//***************************************************************************
	CJob(function<void()> callback) : _callback(move(callback)) {

	}
	virtual ~CJob() = default;

	//***************************************************************************
	// @brief 저장된 작업을 실행합니다.
	// @detail 내부에 등록된 콜백 함수를 호출하여 작업을 수행합니다.
	//***************************************************************************
	void Execute() {
		_callback();
	}

private:
	function<void()> _callback; // 실행할 콜백 함수 객체
};

#endif // ndef __JOB_H__