
//***************************************************************************
// BufferWriter.cpp : implementation of the CBufferWriter class.
//
//***************************************************************************

#include "pch.h"
#include "BufferWriter.h"

//***************************************************************************
// @brief CBufferWriter 기본 객체를 생성합니다.
//***************************************************************************
CBufferWriter::CBufferWriter()
{
}

//***************************************************************************
// @brief BufferWriter 객체를 초기화하며 생성합니다.
// @param buffer 기록할 대상 메모리 버퍼 포인터
// @param size 버퍼의 전체 크기
// @param pos 초기 쓰기 커서 위치 (기본값: 0)
//***************************************************************************
CBufferWriter::CBufferWriter(BYTE* buffer, uint32 size, uint32 pos)
	: _buffer(buffer), _size(size), _pos(pos)
{
}

//***************************************************************************
// @brief BufferWriter 소멸자입니다.
//***************************************************************************
CBufferWriter::~CBufferWriter()
{
}

//***************************************************************************
// @brief 지정한 메모리 주소로부터 정해진 크기만큼 버퍼에 기록합니다.
// @param src 기록할 데이터가 담긴 메모리 포인터
// @param len 기록할 바이트 크기
// @return 성공 여부 (여유 공간이 부족하면 false)
//***************************************************************************
bool CBufferWriter::Write(const void* src, uint32 len)
{
	if( FreeSize() < len )
		return false;

	::memcpy(&_buffer[_pos], src, len);
	_pos += len;
	return true;
}