
//***************************************************************************
// BufferReader.cpp : implementation of the CBufferReader class.
//
//***************************************************************************

#include "pch.h"
#include "BufferReader.h"

//***************************************************************************
// @brief CBufferReader 기본 객체를 생성합니다.
//***************************************************************************
CBufferReader::CBufferReader()
{
}

//***************************************************************************
// @brief CBufferReader 객체를 초기화하며 생성합니다.
// @param buffer 읽어올 대상 메모리 버퍼 포인터
// @param size 버퍼의 전체 크기
// @param pos 초기 읽기 커서 위치 (기본값: 0)
//***************************************************************************
CBufferReader::CBufferReader(BYTE* buffer, uint32 size, uint32 pos)
	: _buffer(buffer), _size(size), _pos(pos)
{
}

//***************************************************************************
// @brief CBufferReader 소멸자입니다.
//***************************************************************************
CBufferReader::~CBufferReader()
{
}

//***************************************************************************
// @brief 커서를 이동하지 않고 현재 위치에서 지정한 크기만큼 데이터를 미리 읽습니다.
// @param dest 데이터를 복사하여 담을 메모리 포인터
// @param len 읽어 들일 바이트 크기
// @return 성공 여부 (남은 데이터 크기가 요청 크기보다 작으면 false)
//***************************************************************************
bool CBufferReader::Peek(void* dest, uint32 len)
{
	if( FreeSize() < len )
		return false;

	::memcpy(dest, &_buffer[_pos], len);
	return true;
}

//***************************************************************************
// @brief 지정한 크기만큼 데이터를 읽고 읽기 커서를 이동합니다.
// @param dest 데이터를 복사하여 담을 메모리 포인터
// @param len 읽어 들일 바이트 크기
// @return 성공 여부 (유효 데이터 부족 시 false)
//***************************************************************************
bool CBufferReader::Read(void* dest, uint32 len)
{
	if( Peek(dest, len) == false )
		return false;

	_pos += len;
	return true;
}